Documents/КорректировкаИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КорректировкаИнвойса</Name>
			<BasedOn>
				<xr:Item>Document._Инвойс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.СкорректированныеИнвойсы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураДоКорректировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСтроки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСтрокИнвойса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/_ВзаиморасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>_ВзаиморасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВКД_ОприходованиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ОприходованиеНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СкорректированныеИнвойсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СкорректированныеИнвойсы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтрокИнвойса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыСтрокИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСтрокИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходитВИнвойс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавленаКорректировкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БудетДобавленаКорректировкой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаИнвойса/Ext/ObjectModule.bsl
// © Primus1C  01.07.2023  НАЧАЛО ►

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._Инвойс") Тогда
		
		ЗаполнитьПоИнвойсу(ДанныеЗаполнения);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр _ВзаиморасчетыСПоставщиками Приход 
	Если Сумма <> Инвойс.Сумма Тогда
		Движения._ВзаиморасчетыСПоставщиками.Записывать = Истина;
		Движение = Движения._ВзаиморасчетыСПоставщиками.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Контрагент 	= Инвойс.Контрагент;
		Движение.Инвойс 		= Инвойс;
		Движение.Валюта 		= Инвойс.Валюта;
		Движение.СуммаОплаты 	= Сумма - Инвойс.Сумма;
	КонецЕсли;

	// регистр ВКД_ОприходованиеНоменклатуры Приход  
	Движения.ВКД_ОприходованиеНоменклатуры.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Товары Цикл   
		Если СтрокаТЧ.Количество <> СтрокаТЧ.КоличествоДоКорректировки ИЛИ СтрокаТЧ.Сумма <> СтрокаТЧ.СуммаДоКорректировки Тогда
			Движение = Движения.ВКД_ОприходованиеНоменклатуры.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Номенклатура 	= СтрокаТЧ.Номенклатура;
			Движение.Документ 		= Инвойс;
			Движение.Количество 	= СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоКорректировки;
			Движение.СуммаЗакупки 	= СтрокаТЧ.Сумма - СтрокаТЧ.СуммаДоКорректировки; 
			Движение.ЦенаЗакупки 	= СтрокаТЧ.Цена;
		КонецЕсли;
	КонецЦикла;
	
	// регистр СкорректированныеИнвойсы 
	ПоляСтруктуры = "Номенклатура,Количество,Сумма,ТипСтроки,НомерСтрокиИнвойса";
	Движения.СкорректированныеИнвойсы.Записывать = Истина;
	Движения.СкорректированныеИнвойсы.Очистить();
	Для Каждого СтрокаТЧ Из Товары Цикл
        ТипСтроки = ?(СтрокаТЧ.ТипСтроки = Перечисления.ТипыСтрокИнвойса.ВходитВИнвойс, 
						Перечисления.ТипыСтрокИнвойса.ВходитВИнвойс, 
						Перечисления.ТипыСтрокИнвойса.ДобавленаКорректировкой); 
		Если СтрокаТЧ.НоменклатураДоКорректировки = СтрокаТЧ.Номенклатура Тогда
			// изм. кол-ва/суммы
			Если СтрокаТЧ.КоличествоДоКорректировки = СтрокаТЧ.Количество И СтрокаТЧ.СуммаДоКорректировки = СтрокаТЧ.Сумма Тогда
			    Продолжить;
			КонецЕсли;
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
														СтрокаТЧ.Номенклатура,
														СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоКорректировки,
			                                            СтрокаТЧ.Сумма - СтрокаТЧ.СуммаДоКорректировки,
			                                            ТипСтроки, 
														СтрокаТЧ.НомерСтроки));	
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.НоменклатураДоКорректировки) Тогда
			// изм. номенклатуры, возможно кол-ва/суммы
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
			                                            СтрокаТЧ.НоменклатураДоКорректировки,
														-СтрокаТЧ.КоличествоДоКорректировки,
			                                            -СтрокаТЧ.СуммаДоКорректировки,
			                                            ТипСтроки, 
														СтрокаТЧ.НомерСтроки));
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
			                                            СтрокаТЧ.Номенклатура,
														СтрокаТЧ.Количество,
			                                            СтрокаТЧ.Сумма,
			                                            ТипСтроки,
														СтрокаТЧ.НомерСтроки));	
		Иначе	
			// добавл. номенклатуры
			Если СтрокаТЧ.Количество = 0 И СтрокаТЧ.Сумма = 0 Тогда
			    Продолжить;
			КонецЕсли;
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
			                                            СтрокаТЧ.Номенклатура,
														СтрокаТЧ.Количество,
			                                            СтрокаТЧ.Сумма,
			                                            Перечисления.ТипыСтрокИнвойса.ДобавленаКорректировкой,
														СтрокаТЧ.НомерСтроки));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьДвижениеСкорректированныеИнвойсы(ДанныеЗаписи)

	Движение = Движения.СкорректированныеИнвойсы.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ДанныеЗаписи); 
    Движение.Период = Дата;
	Движение.Инвойс = Инвойс;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	Сумма = Товары.Итог("Сумма");
	Количество = Товары.Итог("Количество");
	
	Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры

Процедура ЗаполнитьПоИнвойсу(ДанныеЗаполнения) Экспорт
	
	Запр = Новый Запрос;   
	Запр.УстановитьПараметр("Инвойс", ДанныеЗаполнения);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.Номенклатура, ИнвойсТовары.Номенклатура) КАК НоменклатураДоКорректировки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.Номенклатура, ИнвойсТовары.Номенклатура) КАК Номенклатура,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.ТипСтроки, ЗНАЧЕНИЕ(Перечисление.ТипыСтрокИнвойса.ВходитВИнвойс)) КАК ТипСтроки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.КоличествоОборот, 0) КАК КоличествоДоКорректировки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.КоличествоОборот, 0) КАК Количество,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.СуммаОборот, 0) КАК СуммаДоКорректировки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.СуммаОборот, 0) КАК Сумма,
	             |	ЕСТЬNULL(ВЫБОР
	             |			КОГДА СкоррИнвойсыОбороты.КоличествоОборот = 0
	             |				ТОГДА 0
	             |			ИНАЧЕ СкоррИнвойсыОбороты.СуммаОборот / СкоррИнвойсыОбороты.КоличествоОборот
	             |		КОНЕЦ, 0) КАК ЦенаДоКорректировки,
	             |	ЕСТЬNULL(ВЫБОР
	             |			КОГДА СкоррИнвойсыОбороты.КоличествоОборот = 0
	             |				ТОГДА 0
	             |			ИНАЧЕ СкоррИнвойсыОбороты.СуммаОборот / СкоррИнвойсыОбороты.КоличествоОборот
	             |		КОНЕЦ, 0) КАК Цена,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.НомерСтрокиИнвойса, ИнвойсТовары.НомерСтроки) КАК НомерСтрокиИнвойса
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ИнвойсТовары.НомерСтроки КАК НомерСтроки,
	             |		ИнвойсТовары.Номенклатура КАК Номенклатура
	             |	ИЗ
	             |		Документ._Инвойс.ВКД_Товары КАК ИнвойсТовары
	             |	ГДЕ
	             |		ИнвойсТовары.Ссылка = &Инвойс) КАК ИнвойсТовары
	             |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.СкорректированныеИнвойсы.Обороты(, , , Инвойс = &Инвойс) КАК СкоррИнвойсыОбороты
	             |		ПО ИнвойсТовары.НомерСтроки = СкоррИнвойсыОбороты.НомерСтрокиИнвойса
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерСтрокиИнвойса"; 
	Выгрузка = Запр.Выполнить().Выгрузить();	
	Товары.Загрузить(Выгрузка);
    Инвойс = ДанныеЗаполнения;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
